---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementDomainData
source: html/e0fdcb90-d17f-3c2b-2977-01772d4ee60a.htm
---
# Autodesk.Revit.DB.SpatialElementDomainData

A base class for specific domain requirements for a spatial element.

## Syntax (C#)
```csharp
public class SpatialElementDomainData : IDisposable
```